app/controllers/hackathons_controller.rb

SELECT  "hackathons".* FROM "hackathons" WHERE (date_start >= '2015-05-18 11:55:58.814598')  ORDER BY "hackathons"."date_start" ASC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "hackathons" WHERE (date_start >= '2015-05-18 11:55:58.814598')
---
  def index
    q_param = params[:q]
    page = params[:page]
    per_page = params[:per_page]

    @q = Hackathon.ransack q_param
    @hackathons = @q.result.where('date_start >= ?', Time.zone.now).order(date_start: :asc).page(page).per(per_page)