app/controllers/password_resets_controller.rb

  def edit
    @user = User.find_by(password_reset_token: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."password_reset_token" = ? LIMIT 1  [["password_reset_token", "notfound"]]

  def update
    @user = User.find_by(password_reset_token: params[:id])
    if @user && @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."password_reset_token" = ? LIMIT 1  [["password_reset_token", "0F88xcs6VRGy1aYC2agI-utKcJUuTLI_lEqgWgD79FpZAbHlTHSllU176DP0WzGA"]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$Gl7U4rb1LCyA5WWRxPR/cOE5WUSDoKy5H.1Aam08Qc8dQ4B276Yg."], ["updated_at", "2015-05-19 09:57:35.539016"], ["id", 1]]