app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["first_name", "MyString"], ["created_at", "2015-05-18 10:45:03.056702"], ["updated_at", "2015-05-18 10:45:03.056702"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save